* >Natural Source Code: PRODUPD
* SUBPROGRAM: PRODUPD - PRODUCT UPDATE (NON-INTERACTIVE)
* DESCRIPTION: UPDATES PRODUCT RECORDS - CALLED BY
*              OTHER MODULES AND BATCH PROCESSES
* LIBRARY: RETAILCORE
* ADABAS FILE: 101 (PRODUCT)
* CREATED: 1999-03-20  T. ANDERSON
* MODIFIED: 2008-07-15 - ADDED CLEARANCE DATE SETTING
* MODIFIED: 2016-01-22 - ADDED LAST-SOLD UPDATE
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-PROD-ID             (N8)
  1 P-NAME                (A60)
  1 P-STATUS              (A1)
  1 P-BASE-COST           (N9.2)
  1 P-BASE-PRICE          (N9.2)
  1 P-WEB-FLAG            (A1)
  1 P-RC-FLAG             (A1)
  1 P-RC-TEXT             (A60)
*
LOCAL
  1 #USER-ID              (A8)
  1 #PROD-ID-STR          (A15)
  1 #OLD-STATUS           (A1)
*
  1 PROD-UPD-VIEW VIEW OF PRODUCT-FILE
    2 PR-ID                (N8)
    2 PR-NAME              (A60)
    2 PR-STATUS            (A1)
    2 PR-BASE-COST         (N9.2)
    2 PR-BASE-PRICE        (N9.2)
    2 PR-WEB-ENABLED       (A1)
    2 PR-CLEARANCE-DATE    (D)
    2 PR-DISCO-DATE        (D)
    2 PR-LAST-SOLD         (D)
    2 PR-MODIFIED-DATE     (D)
    2 PR-MODIFIED-BY       (A8)
END-DEFINE
*
MOVE *USER TO #USER-ID
MOVE 'Y' TO P-RC-FLAG
RESET P-RC-TEXT
*
IF P-PROD-ID = 0
  MOVE 'N' TO P-RC-FLAG
  MOVE 'PRODUCT ID REQUIRED' TO P-RC-TEXT
  ESCAPE ROUTINE
END-IF
*
FIND PROD-UPD-VIEW WITH PR-ID = P-PROD-ID
  IF NO RECORDS FOUND
    MOVE 'N' TO P-RC-FLAG
    MOVE 'PRODUCT NOT FOUND' TO P-RC-TEXT
    ESCAPE ROUTINE
  END-NOREC
*
  GET PROD-UPD-VIEW *ISN (HOLD)
*
  ON ERROR
    IF *ERROR-NR = 145
      MOVE 'N' TO P-RC-FLAG
      MOVE 'PRODUCT RECORD LOCKED' TO P-RC-TEXT
      ESCAPE ROUTINE
    END-IF
  END-ERROR
*
  MOVE PR-STATUS TO #OLD-STATUS
*
  IF P-NAME NE ' '
    MOVE P-NAME TO PR-NAME
  END-IF
  IF P-STATUS NE ' '
    MOVE P-STATUS TO PR-STATUS
    * SET CLEARANCE DATE IF CHANGING TO CLEARANCE
    * MODIFIED 2008-07-15
    IF P-STATUS = 'C' AND #OLD-STATUS NE 'C'
      MOVE *DATX TO PR-CLEARANCE-DATE
    END-IF
    * SET DISCONTINUATION DATE
    IF P-STATUS = 'D' AND #OLD-STATUS NE 'D'
      MOVE *DATX TO PR-DISCO-DATE
    END-IF
  END-IF
  IF P-BASE-COST > 0
    MOVE P-BASE-COST TO PR-BASE-COST
  END-IF
  IF P-BASE-PRICE > 0
    MOVE P-BASE-PRICE TO PR-BASE-PRICE
  END-IF
  IF P-WEB-FLAG NE ' '
    MOVE P-WEB-FLAG TO PR-WEB-ENABLED
  END-IF
*
  MOVE *DATX    TO PR-MODIFIED-DATE
  MOVE #USER-ID TO PR-MODIFIED-BY
  UPDATE PROD-UPD-VIEW
  ESCAPE BOTTOM
END-FIND
*
END OF TRANSACTION
*
MOVE P-PROD-ID TO #PROD-ID-STR
CALLNAT 'AUDITN' 'PROD' #PROD-ID-STR 'U' 'PRODUCT'
  #OLD-STATUS P-STATUS 'PRODUCT UPDATED'
*
END
