* >Natural Source Code: PRODCAT
* SUBPROGRAM: PRODCAT - PRODUCT CATEGORY MANAGEMENT
* DESCRIPTION: MANAGES PRODUCT CATEGORIZATION
*              VALIDATES DEPT/CLASS/SUBCLASS CODES
* LIBRARY: RETAILCORE
* ADABAS FILE: 102 (CATEGORY)
* CREATED: 1999-05-15  T. ANDERSON
* MODIFIED: 2007-03-22 - ADDED CATEGORY PATH BUILD
* MODIFIED: 2016-09-10 - ADDED CATEGORY HIERARCHY
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-OPERATION           (A4)    /* VLDT LOOK PATH LIST */
  1 P-DEPT                (A4)
  1 P-CLASS               (A4)
  1 P-SUBCLASS            (A4)
  1 P-DEPT-NAME           (A30)
  1 P-CLASS-NAME          (A30)
  1 P-SUBCLASS-NAME       (A30)
  1 P-CATEGORY-PATH       (A60)
  1 P-VALID-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 CAT-VIEW VIEW OF CATEGORY-FILE
    2 CT-DEPT              (A4)
    2 CT-DEPT-NAME         (A30)
    2 CT-CLASS             (A4)
    2 CT-CLASS-NAME        (A30)
    2 CT-SUBCLASS          (A4)
    2 CT-SUBCLASS-NAME     (A30)
    2 CT-STATUS            (A1)
    2 CT-PARENT-DEPT       (A4)
END-DEFINE
*
MOVE 'Y' TO P-VALID-FLAG
RESET P-ERROR-MSG
*
DECIDE ON FIRST VALUE OF P-OPERATION
  VALUE 'VLDT'
    PERFORM VALIDATE-CATEGORY
  VALUE 'LOOK'
    PERFORM LOOKUP-CATEGORY
  VALUE 'PATH'
    PERFORM BUILD-PATH
  NONE VALUE
    MOVE 'N' TO P-VALID-FLAG
    MOVE 'INVALID CATEGORY OPERATION' TO P-ERROR-MSG
END-DECIDE
*
DEFINE SUBROUTINE VALIDATE-CATEGORY
  IF P-DEPT = ' '
    MOVE 'N' TO P-VALID-FLAG
    MOVE 'DEPARTMENT CODE REQUIRED' TO P-ERROR-MSG
    ESCAPE ROUTINE
  END-IF
  FIND CAT-VIEW WITH CT-DEPT = P-DEPT
    IF NO RECORDS FOUND
      MOVE 'N' TO P-VALID-FLAG
      MOVE 'DEPARTMENT NOT FOUND' TO P-ERROR-MSG
      ESCAPE ROUTINE
    END-NOREC
    IF CT-STATUS NE 'A'
      MOVE 'N' TO P-VALID-FLAG
      MOVE 'DEPARTMENT IS INACTIVE' TO P-ERROR-MSG
      ESCAPE ROUTINE
    END-IF
    MOVE CT-DEPT-NAME TO P-DEPT-NAME
    IF P-CLASS NE ' '
      IF CT-CLASS NE P-CLASS
        ESCAPE TOP
      END-IF
      MOVE CT-CLASS-NAME TO P-CLASS-NAME
      IF P-SUBCLASS NE ' '
        IF CT-SUBCLASS NE P-SUBCLASS
          ESCAPE TOP
        END-IF
        MOVE CT-SUBCLASS-NAME TO P-SUBCLASS-NAME
      END-IF
    END-IF
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
DEFINE SUBROUTINE LOOKUP-CATEGORY
  FIND CAT-VIEW WITH CT-DEPT = P-DEPT
      AND CT-CLASS = P-CLASS
    IF NO RECORDS FOUND
      MOVE 'N' TO P-VALID-FLAG
      MOVE 'CATEGORY NOT FOUND' TO P-ERROR-MSG
      ESCAPE ROUTINE
    END-NOREC
    MOVE CT-DEPT-NAME     TO P-DEPT-NAME
    MOVE CT-CLASS-NAME    TO P-CLASS-NAME
    MOVE CT-SUBCLASS-NAME TO P-SUBCLASS-NAME
    ESCAPE BOTTOM
  END-FIND
END-SUBROUTINE
*
DEFINE SUBROUTINE BUILD-PATH
  PERFORM LOOKUP-CATEGORY
  IF P-VALID-FLAG = 'Y'
    COMPRESS P-DEPT-NAME '>' P-CLASS-NAME '>' P-SUBCLASS-NAME
      INTO P-CATEGORY-PATH
  END-IF
END-SUBROUTINE
*
END
