* >Natural Source Code: PRODGET
* SUBPROGRAM: PRODGET - PRODUCT RETRIEVAL
* DESCRIPTION: RETRIEVES PRODUCT DATA BY ID OR SKU
* LIBRARY: RETAILCORE
* ADABAS FILE: 101 (PRODUCT)
* CREATED: 1998-07-05  T. ANDERSON
* MODIFIED: 2004-03-10 - ADDED WEB FIELDS
* MODIFIED: 2015-06-22 - ADDED LIFECYCLE DATA
* MODIFIED: 2020-09-15 - ADDED SUPPLIER CROSS-REF
* -------------------------------------------------------
DEFINE DATA
PARAMETER
  1 P-PROD-ID             (N8)
  1 P-SKU                 (A15)
  1 P-PRODUCT-DATA
    2 P-PD-ID             (N8)
    2 P-PD-SKU            (A15)
    2 P-PD-ITEM-NO        (A12)    /* LEGACY ITEM NUMBER */
    2 P-PD-NAME           (A60)
    2 P-PD-SHORT-DESC     (A30)
    2 P-PD-LONG-DESC      (A200)
    2 P-PD-STATUS         (A1)
    2 P-PD-TYPE           (A2)
    2 P-PD-BRAND          (A30)
    2 P-PD-MANUFACTURER   (A40)
    2 P-PD-UPC            (A13)
  1 P-PRODUCT-CATEGORY
    2 P-PC-DEPT           (A4)
    2 P-PC-CLASS          (A4)
    2 P-PC-SUBCLASS       (A4)
    2 P-PC-CATEGORY-PATH  (A60)
  1 P-PRODUCT-ATTRIBUTES
    2 P-PA-COLOR          (A20)
    2 P-PA-SIZE           (A10)
    2 P-PA-WEIGHT         (N7.3)
    2 P-PA-PERISHABLE     (A1)
    2 P-PA-HAZARDOUS      (A1)
    2 P-PA-SEASONAL       (A1)
  1 P-PRODUCT-PRICE
    2 P-PP-BASE-COST      (N9.2)
    2 P-PP-BASE-PRICE     (N9.2)
    2 P-PP-MSRP           (N9.2)
    2 P-PP-MIN-PRICE      (N9.2)
    2 P-PP-TAX-CODE       (A4)
    2 P-PP-CURRENCY       (A3)
  1 P-PRODUCT-LIFECYCLE
    2 P-PL-INTRO-DATE     (D)
    2 P-PL-DISCO-DATE     (D)
    2 P-PL-CLEARANCE-DATE (D)
    2 P-PL-LAST-SOLD      (D)
  1 P-FOUND-FLAG          (A1)
  1 P-ERROR-MSG           (A60)
*
LOCAL
  1 PROD-VIEW VIEW OF PRODUCT-FILE
    2 PR-ID                (N8)
    2 PR-SKU               (A15)
    2 PR-ITEM-NO           (A12)
    2 PR-NAME              (A60)
    2 PR-SHORT-DESC        (A30)
    2 PR-LONG-DESC         (A200)
    2 PR-STATUS            (A1)
    2 PR-TYPE              (A2)
    2 PR-BRAND             (A30)
    2 PR-MANUFACTURER      (A40)
    2 PR-UPC               (A13)
    2 PR-DEPT              (A4)
    2 PR-CLASS             (A4)
    2 PR-SUBCLASS          (A4)
    2 PR-COLOR             (A20)
    2 PR-SIZE              (A10)
    2 PR-WEIGHT            (N7.3)
    2 PR-PERISHABLE        (A1)
    2 PR-HAZARDOUS         (A1)
    2 PR-SEASONAL          (A1)
    2 PR-BASE-COST         (N9.2)
    2 PR-BASE-PRICE        (N9.2)
    2 PR-MSRP              (N9.2)
    2 PR-MIN-PRICE         (N9.2)
    2 PR-TAX-CODE          (A4)
    2 PR-CURRENCY          (A3)
    2 PR-INTRO-DATE        (D)
    2 PR-DISCO-DATE        (D)
    2 PR-CLEARANCE-DATE    (D)
    2 PR-LAST-SOLD         (D)
END-DEFINE
*
MOVE 'N' TO P-FOUND-FLAG
RESET P-ERROR-MSG
*
* SEARCH BY ID OR SKU
IF P-PROD-ID > 0
  FIND PROD-VIEW WITH PR-ID = P-PROD-ID
    IF NO RECORDS FOUND
      MOVE 'PRODUCT NOT FOUND' TO P-ERROR-MSG
      ESCAPE ROUTINE
    END-NOREC
    PERFORM POPULATE-PRODUCT
    ESCAPE BOTTOM
  END-FIND
ELSE IF P-SKU NE ' '
  FIND PROD-VIEW WITH PR-SKU = P-SKU
    IF NO RECORDS FOUND
      MOVE 'SKU NOT FOUND' TO P-ERROR-MSG
      ESCAPE ROUTINE
    END-NOREC
    PERFORM POPULATE-PRODUCT
    ESCAPE BOTTOM
  END-FIND
ELSE
  MOVE 'PRODUCT ID OR SKU REQUIRED' TO P-ERROR-MSG
  ESCAPE ROUTINE
END-IF
END-IF
*
ON ERROR
  COMPRESS 'DATABASE ERROR:' *ERROR-NR INTO P-ERROR-MSG
  CALLNAT 'LOGERR' 100 P-ERROR-MSG 'E' 'PRODGET' *USER
END-ERROR
*
DEFINE SUBROUTINE POPULATE-PRODUCT
  MOVE PR-ID           TO P-PD-ID
  MOVE PR-SKU          TO P-PD-SKU
  MOVE PR-ITEM-NO      TO P-PD-ITEM-NO
  MOVE PR-NAME         TO P-PD-NAME
  MOVE PR-SHORT-DESC   TO P-PD-SHORT-DESC
  MOVE PR-LONG-DESC    TO P-PD-LONG-DESC
  MOVE PR-STATUS       TO P-PD-STATUS
  MOVE PR-TYPE         TO P-PD-TYPE
  MOVE PR-BRAND        TO P-PD-BRAND
  MOVE PR-MANUFACTURER TO P-PD-MANUFACTURER
  MOVE PR-UPC          TO P-PD-UPC
  MOVE PR-DEPT         TO P-PC-DEPT
  MOVE PR-CLASS        TO P-PC-CLASS
  MOVE PR-SUBCLASS     TO P-PC-SUBCLASS
  COMPRESS PR-DEPT '/' PR-CLASS '/' PR-SUBCLASS INTO P-PC-CATEGORY-PATH
  MOVE PR-COLOR        TO P-PA-COLOR
  MOVE PR-SIZE         TO P-PA-SIZE
  MOVE PR-WEIGHT       TO P-PA-WEIGHT
  MOVE PR-PERISHABLE   TO P-PA-PERISHABLE
  MOVE PR-HAZARDOUS    TO P-PA-HAZARDOUS
  MOVE PR-SEASONAL     TO P-PA-SEASONAL
  MOVE PR-BASE-COST    TO P-PP-BASE-COST
  MOVE PR-BASE-PRICE   TO P-PP-BASE-PRICE
  MOVE PR-MSRP         TO P-PP-MSRP
  MOVE PR-MIN-PRICE    TO P-PP-MIN-PRICE
  MOVE PR-TAX-CODE     TO P-PP-TAX-CODE
  MOVE PR-CURRENCY     TO P-PP-CURRENCY
  MOVE PR-INTRO-DATE   TO P-PL-INTRO-DATE
  MOVE PR-DISCO-DATE   TO P-PL-DISCO-DATE
  MOVE PR-CLEARANCE-DATE TO P-PL-CLEARANCE-DATE
  MOVE PR-LAST-SOLD    TO P-PL-LAST-SOLD
  MOVE 'Y' TO P-FOUND-FLAG
END-SUBROUTINE
*
END
